my_facts={"Рост":
          "177",
          "Вес":
          "72",
          "Цвет":
          "Зелёный",
          "Фильм":
          "Зелёная миля",
          "Актер":
          "Джеки Чан"}
n=input("Введmy_facts={"Рост":
          "177",
          "Вес":
          "72",
          "Цвет":
          "Зелёный",
          "Фильм":
          "Зелёная миля",
          "Актер":
          "Джеки Чан"}
n=input("Введите слово")
if n in my_facts:
    fact = my_facts[n]
    print(fact)
else:
    print("Попробуйте ещё раз")
