
def f(x,y,z, d=16, a=5):
    """ Возвращает результат умножения 3 обязательных параметров
    с двумя необязательным�
def f(x,y,z, d=16, a=5):
    """ Возвращает результат умножения 3 обязательных параметров
    с двумя необязательными параметрами
    :параметр x: целое число.
    :параметр y: целое число.
    :параметр z: целое число.
    :параметр d: целое число.
    :параметр z: целое число.
    :return: целое число.
    """
    return (x+y+z+d+a)
sum = f(5,5,5)
print(sum)

    
